In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')
engine.connect()

In [3]:
query = """
SELECT *
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog' AND 
    schemaname != 'information_schema';
"""

pd.read_sql(query, con=engine)

,schemaname,tablename,tableowner,tablespace,hasindexes,hasrules,hastriggers,rowsecurity
0,public,green_taxi_data,root,None,True,False,False,False
1,public,zones,root,None,True,False,False,False

In [17]:
query = """
SELECT COUNT(*) AS total_trips
FROM green_taxi_data	
WHERE 
    DATE(lpep_pickup_datetime) = '2019-09-18' 
    AND DATE(lpep_dropoff_datetime) = '2019-09-18';
"""

pd.read_sql(query, con=engine)

   total_trips
0        15612

In [18]:
query = """
SELECT
    DATE(lpep_pickup_datetime) AS pickup_day,
    MAX(trip_distance) AS max_trip_distance
FROM green_taxi_data
GROUP BY pickup_day
ORDER BY max_trip_distance DESC
LIMIT 1;
"""

pd.read_sql(query, con=engine)

   pickup_day  max_trip_distance
0  2019-09-26             341.64

In [35]:
query = """
SELECT *
FROM green_taxi_data
JOIN zones ON green_taxi_data."PULocationID" = zones."LocationID"
LIMIT 5;
"""

pd.read_sql(query, con=engine)

,index,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,...,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge,index,LocationID,Borough,Zone,service_zone
0,0,2,2019-09-01 00:10:53,2019-09-01 00:23:46,N,1,65,189,5,2.00,...,0.3,14.16,1,1,0.0,64,65,Brooklyn,Downtown Brooklyn/MetroTech,Boro Zone
1,1,2,2019-09-01 00:31:22,2019-09-01 00:44:37,N,1,97,225,5,3.20,...,0.3,13.30,2,1,0.0,96,97,Brooklyn,Fort Greene,Boro Zone
2,2,2,2019-09-01 00:50:24,2019-09-01 01:03:20,N,1,37,61,5,2.99,...,0.3,13.30,2,1,0.0,36,37,Brooklyn,Bushwick South,Boro Zone
3,3,2,2019-09-01 00:27:06,2019-09-01 00:33:22,N,1,145,112,1,1.73,...,0.3,10.30,1,1,0.0,144,145,Queens,Long Island City/Hunters Point,Boro Zone
4,4,2,2019-09-01 00:43:23,2019-09-01 00:59:54,N,1,112,198,1,3.42,...,0.3,18.36,1,1,0.0,111,112,Brooklyn,Greenpoint,Boro Zone

In [53]:
query = """
SELECT
    z."Borough",
    SUM(gt.total_amount) AS total_amount_sum
FROM green_taxi_data gt
JOIN zones z ON gt."PULocationID" = z."LocationID"
GROUP BY z."Borough"
HAVING SUM(gt.total_amount) > 50000
ORDER BY SUM(gt.total_amount) DESC;
"""

pd.read_sql(query, con=engine)

     Borough  total_amount_sum
0   Brooklyn      2.619379e+06
1     Queens      2.460386e+06
2  Manhattan      2.427881e+06
3      Bronx      8.181581e+05

In [74]:
query = """
SELECT
    z_dropoff."Zone" AS dropoff_zone_name,
    MAX(gt.tip_amount) AS max_tip_amount
FROM green_taxi_data gt
JOIN zones z_pickup ON gt."PULocationID" = z_pickup."LocationID"
JOIN zones z_dropoff ON gt."DOLocationID" = z_dropoff."LocationID"
WHERE
    z_pickup."Zone" = 'Astoria'
    AND EXTRACT(YEAR FROM gt.lpep_pickup_datetime) = 2019
    AND EXTRACT(MONTH FROM gt.lpep_pickup_datetime) = 9
GROUP BY z_dropoff."Zone"
ORDER BY MAX(gt.tip_amount) DESC;
"""

pd.read_sql(query, con=engine)

         dropoff_zone_name  max_tip_amount
0              JFK Airport           62.31
1                 Woodside           30.00
2                 Kips Bay           28.00
3                       NV           25.00
4    Upper West Side South           20.00
..                     ...             ...
208          Starrett City            0.00
209     Claremont/Bathgate            0.00
210            City Island            0.00
211               Canarsie            0.00
212       Sunset Park West            0.00

[213 rows x 2 columns]